---
kind: method
id: M:Autodesk.Revit.DB.LayoutRuleFixedDistance.#ctor(System.Double,Autodesk.Revit.DB.BeamSystemJustifyType)
source: html/1b05e7b9-25c3-ae4b-79de-72373c408248.htm
---
# Autodesk.Revit.DB.LayoutRuleFixedDistance.#ctor Method

Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.

## Syntax (C#)
```csharp
public LayoutRuleFixedDistance(
	double spacing,
	BeamSystemJustifyType justifyType
)
```

## Parameters
- **spacing** (`System.Double`) - The value of spacing must be between 0 and 30000.
- **justifyType** (`Autodesk.Revit.DB.BeamSystemJustifyType`) - The type of the justification, it's corresponding to the items in the element properties dialog.